app/views/users/_user.html.erb

SELECT  "users".* FROM "users" LIMIT $1 OFFSET $2  [["LIMIT", 4], ["OFFSET", 0]]
---
  <p> <%= link_to user.email, user %> </p>
  <h4> <%= user.user_profile.first_name %>