app/controllers/forgot_password_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ateseyko@qulix.com"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by(email: params[:forgot_password][:email].downcase)

UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$dO6ZTJVJSiNKzH/mcmum.uXY242sMjxqNSeJH.nME8HEBEy5ubjtC"], ["updated_at", 2016-09-02 13:58:10 UTC], ["id", 9]]
---
  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)