app/controllers/users_controller.rb

  def index
    @users = User.reorder("email").paginate(page: params[:page], :per_page => 4)
---
SELECT  "users".* FROM "users" LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_profile_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "second_name" = $2, "city" = $3, "birthday" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["first_name", "Anatoly"], ["second_name", "Teseyko"], ["city", "Minsk"], ["birthday", Wed, 21 Aug 1991], ["updated_at", 2016-09-01 10:34:47 UTC], ["id", 1]]

  def create
    @user = User.new(user_create_params)
    if @user.save
---
INSERT INTO "users" ("nickname", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"